#pragma once

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#define ROW 5
#define COL 10

char Maps[8][8][10] = {
	{"天山",   "楼兰",   "白驼山",  "野猪林",   "水晶洞",  "天蚕洞",  "黑风寨",   "冰火岛"},
	{"迷宫",   "凌霄城",  "轩辕岭", "华山",     "嵩山",    "紫禁城",  "快活林",   "神龙岛"},
	{"西域",   "葫芦谷",  "唐门",   "终南山",   "石窟",    "客栈",    "玉皇顶",   "灵蛇岛"},
	{"光明顶", "摩天崖",  "聚贤庄", "后山",     "武当山",  "开封府",  "二十四桥", "蓬莱仙境"},
	{"擂鼓山", "峨眉山",  "迷踪林", "五虎岭",   "天宁寺",  "积善堂",  "镇江府",   "桃花岛"},
	{"恶人谷", "大理",    "百花谷", "孔雀山庄", "五霸岗",  "万仞堂",  "千年古刹", "六合塔"},
	{"玩偶庄", "黑木崖",  "蝴蝶谷", "铁花堡",   "霹雳堂",  "关帝庙",  "麒麟庄",   "销魂宫"},
	{"石府",   "金三角",  "忏悔崖", "通吃岛",   "通天观",  "紫霞亭",  "天弃庵",   "侠客岛"}
};

void 一维数组示例() {
	//C语言中，没有单独的字符串类型
	//使用字符串数组表示一个字符串
	char name[] = "你的名字";
	//ASCII码 a-97 A-65   \0 -> ASCII为0的字符，空字符
	//一个中文字符占 2 个字节
	//C语言中，字符串和字符串数组的区别：字符串就是结尾元素为\0的字符数组
	printf("字符串的长度：%d\n", strlen(name));
}


void 二维数组示例()
{
	char names[ROW][COL] = {
		"基尼太美", 
		"四川唐门", 
		"武当剑法", 
		"大理段氏", 
		"五岳剑派"
	};
	for (int i = 0; i < ROW; i++) {
		printf("%s\n", names[i]);
	}
}

void 打印游戏地图()
{
	for (int i = 0; i < 8; i++) {
		for (int j = 0; j < 8; j++) {
			printf("%-10s", Maps[i][j]);
		}
		printf("\n");
	}
}